// 
// 
// 

#include "CoreBeep.h"

_CoreBeep CoreBeep;

_CoreBeep::_CoreBeep()
{
}

_CoreBeep::~_CoreBeep()
{
}

/************************************************************************************************************
【函 数 名】：  Initialization		小车核心板蜂鸣器接口初始化函数
【参数说明】：	无
【返 回 值】：	无
【简    例】：	Initialization();	初始化小车核心板蜂鸣器接口
************************************************************************************************************/
void _CoreBeep::Initialization(void)
{
	//pin = _pin;
	pinMode(COREBEEP_PIN, OUTPUT);
	digitalWrite(COREBEEP_PIN, TURNOFF);
}

/************************************************************************************************************
【函 数 名】：  TurnOn		小车核心板蜂鸣器打开函数
【参数说明】：	无
【返 回 值】：	无
【简    例】：	TurnOn();	打开小车核心板蜂鸣器
************************************************************************************************************/
void _CoreBeep::TurnOn(void)
{
	//if (s)
	//{
		digitalWrite(COREBEEP_PIN, TURNON);
		//COREBEEP_PORT |= _BV(COREBEEP_BIT);
	//}
}

/************************************************************************************************************
【函 数 名】：  TurnOff		小车核心板蜂鸣器关闭函数
【参数说明】：	无
【返 回 值】：	无
【简    例】：	TurnOff();	关闭小车核心板蜂鸣器
************************************************************************************************************/
void _CoreBeep::TurnOff(void)
{
	//if (s)
	//{
		digitalWrite(COREBEEP_PIN, TURNOFF);
	//	COREBEEP_PORT &= ~_BV(COREBEEP_BIT);
	//}
}


void _CoreBeep::CBeepWhile(uint16_t time)
{

}
