// 
// 
// 

#include "LED.h"

_LED LED;

_LED::_LED()
{
}

_LED::~_LED()
{
}

/************************************************************************************************************
【函 数 名】：	Initialization		初始化任务板LED灯引脚函数
【参数说明】：	无
【返 回 值】：	无
【简    例】：	Initialization();	初始化任务板LED引脚
************************************************************************************************************/
void _LED::Initialization(void)
{
	//L_pin = _L_pin;
	//R_pin = _R_pin;
	pinMode(LED_PIN_L, OUTPUT);
	pinMode(LED_PIN_R, OUTPUT);
	RightTurnOff();
	LeftTurnOff();
}

/************************************************************************************************************
【函 数 名】：	RightTurnOn		打开任务板右灯函数
【参数说明】：	无
【返 回 值】：	无
【简    例】：	RightTurnOn();	打开右灯
************************************************************************************************************/
void _LED::RightTurnOn(void)
{
	digitalWrite(LED_PIN_R, LED_ON);
}

/************************************************************************************************************
【函 数 名】：	RightTurnOFF		关闭任务板右灯函数
【参数说明】：	无
【返 回 值】：	无
【简    例】：	RightTurnOFF();		关闭任务板右灯
************************************************************************************************************/
void _LED::RightTurnOff(void)
{
	digitalWrite(LED_PIN_R, LED_OFF);
}

/************************************************************************************************************
【函 数 名】：	LeftTurnOn		打开任务板左灯函数
【参数说明】：	无
【返 回 值】：	无
【简    例】：	LeftTurnOn();	打开任务板左灯
************************************************************************************************************/
void _LED::LeftTurnOn(void)
{
	digitalWrite(LED_PIN_L, LED_ON);
}

/************************************************************************************************************
【函 数 名】：	LeftTurnOff			关闭任务板左灯函数
【参数说明】：	无
【返 回 值】：	无
【简    例】：	LeftTurnOff();		关闭任务板左灯
************************************************************************************************************/
void _LED::LeftTurnOff(void)
{
	digitalWrite(LED_PIN_L, LED_OFF);
}

